grevaillot/svd_tools/headers/STM32H7x7_CM4/fdcan1.h
#define FDCAN1_FDCAN_GFC_ANFS_SHIFT		4
#define FDCAN1_FDCAN_GFC_ANFS_MASK		0x03
/** @defgroup fdcan1_fdcan_gfc_anfs ANFS Accept Non-matching Frames Standard
@{*/
/**@}*/


#define FDCAN1_FDCAN_GFC_ANFE_SHIFT		2
#define FDCAN1_FDCAN_GFC_ANFE_MASK		0x03
/** @defgroup fdcan1_fdcan_gfc_anfe ANFE Accept Non-matching Frames Extended
@{*/
/**@}*/

/** FDCAN1_FDCAN_GFC_RRFS Reject Remote Frames Standard **/
#define FDCAN1_FDCAN_GFC_RRFS		(1 << 1)
/** FDCAN1_FDCAN_GFC_RRFE Reject Remote Frames Extended **/
#define FDCAN1_FDCAN_GFC_RRFE		(1 << 0)

/**@}*/

/** @defgroup fdcan1_fdcan_sidfc FDCANSIDFC FDCAN Standard ID Filter Configuration Register
@{*/


#define FDCAN1_FDCAN_SIDFC_LSS_SHIFT		16
#define FDCAN1_FDCAN_SIDFC_LSS_MASK		0xff
/** @defgroup fdcan1_fdcan_sidfc_lss LSS List Size Standard
@{*/
/**@}*/


#define FDCAN1_FDCAN_SIDFC_FLSSA_SHIFT		2
#define FDCAN1_FDCAN_SIDFC_FLSSA_MASK		0x3fff
/** @defgroup fdcan1_fdcan_sidfc_flssa FLSSA Filter List Standard Start Address
@{*/
/**@}*/


/**@}*/

/** @defgroup fdcan1_fdcan_xidfc FDCANXIDFC FDCAN Extended ID Filter Configuration Register
@{*/


#define FDCAN1_FDCAN_XIDFC_LSE_SHIFT		16
#define FDCAN1_FDCAN_XIDFC_LSE_MASK		0xff
/** @defgroup fdcan1_fdcan_xidfc_lse LSE List Size Extended
@{*/
/**@}*/


#define FDCAN1_FDCAN_XIDFC_FLESA_SHIFT		2
#define FDCAN1_FDCAN_XIDFC_FLESA_MASK		0x3fff
/** @defgroup fdcan1_fdcan_xidfc_flesa FLESA Filter List Standard Start Address
@{*/
/**@}*/


/**@}*/

/** @defgroup fdcan1_fdcan_xidam FDCANXIDAM FDCAN Extended ID and Mask Register
@{*/


#define FDCAN1_FDCAN_XIDAM_EIDM_SHIFT		0
#define FDCAN1_FDCAN_XIDAM_EIDM_MASK		0x1fffffff
/** @defgroup fdcan1_fdcan_xidam_eidm EIDM Extended ID Mask
@{*/
/**@}*/


/**@}*/

/** @defgroup fdcan1_fdcan_hpms FDCANHPMS FDCAN High Priority Message Status Register
@{*/

/** FDCAN1_FDCAN_HPMS_FLST Filter List **/
#define FDCAN1_FDCAN_HPMS_FLST		(1 << 15)

#define FDCAN1_FDCAN_HPMS_FIDX_SHIFT		8
#define FDCAN1_FDCAN_HPMS_FIDX_MASK		0x7f
/** @defgroup fdcan1_fdcan_hpms_fidx FIDX Filter Index
@{*/
/**@}*/


#define FDCAN1_FDCAN_HPMS_MSI_SHIFT		6
#define FDCAN1_FDCAN_HPMS_MSI_MASK		0x03
/** @defgroup fdcan1_fdcan_hpms_msi MSI Message Storage Indicator
@{*/
/**@}*/


#define FDCAN1_FDCAN_HPMS_BIDX_SHIFT		0
#define FDCAN1_FDCAN_HPMS_BIDX_MASK		0x3f
/** @defgroup fdcan1_fdcan_hpms_bidx BIDX Buffer Index
@{*/
/**@}*/


/**@}*/

/** @defgroup fdcan1_fdcan_ndat1 FDCANNDAT1 FDCAN New Data 1 Register
@{*/

/** FDCAN1_FDCAN_NDAT1_ND31 New data **/
#define FDCAN1_FDCAN_NDAT1_ND31		(1 << 31)
/** FDCAN1_FDCAN_NDAT1_ND30 New data **/
#define FDCAN1_FDCAN_NDAT1_ND30		(1 << 30)
/** FDCAN1_FDCAN_NDAT1_ND29 New data **/
#define FDCAN1_FDCAN_NDAT1_ND29		(1 << 29)
/** FDCAN1_FDCAN_NDAT1_ND28 New data **/
#define FDCAN1_FDCAN_NDAT1_ND28		(1 << 28)
/** FDCAN1_FDCAN_NDAT1_ND27 New data **/
#define FDCAN1_FDCAN_NDAT1_ND27		(1 << 27)
/** FDCAN1_FDCAN_NDAT1_ND26 New data **/
#define FDCAN1_FDCAN_NDAT1_ND26		(1 << 26)
/** FDCAN1_FDCAN_NDAT1_ND25 New data **/
#define FDCAN1_FDCAN_NDAT1_ND25		(1 << 25)
/** FDCAN1_FDCAN_NDAT1_ND24 New data **/
#define FDCAN1_FDCAN_NDAT1_ND24		(1 << 24)
/** FDCAN1_FDCAN_NDAT1_ND23 New data **/
#define FDCAN1_FDCAN_NDAT1_ND23		(1 << 23)
/** FDCAN1_FDCAN_NDAT1_ND22 New data **/
#define FDCAN1_FDCAN_NDAT1_ND22		(1 << 22)
/** FDCAN1_FDCAN_NDAT1_ND21 New data **/
#define FDCAN1_FDCAN_NDAT1_ND21		(1 << 21)
/** FDCAN1_FDCAN_NDAT1_ND20 New data **/
#define FDCAN1_FDCAN_NDAT1_ND20		(1 << 20)
/** FDCAN1_FDCAN_NDAT1_ND19 New data **/
#define FDCAN1_FDCAN_NDAT1_ND19		(1 << 19)
/** FDCAN1_FDCAN_NDAT1_ND18 New data **/
#define FDCAN1_FDCAN_NDAT1_ND18		(1 << 18)
/** FDCAN1_FDCAN_NDAT1_ND17 New data **/
#define FDCAN1_FDCAN_NDAT1_ND17		(1 << 17)
/** FDCAN1_FDCAN_NDAT1_ND16 New data **/
#define FDCAN1_FDCAN_NDAT1_ND16		(1 << 16)
/** FDCAN1_FDCAN_NDAT1_ND15 New data **/
#define FDCAN1_FDCAN_NDAT1_ND15		(1 << 15)
/** FDCAN1_FDCAN_NDAT1_ND14 New data **/
#define FDCAN1_FDCAN_NDAT1_ND14		(1 << 14)
/** FDCAN1_FDCAN_NDAT1_ND13 New data **/
#define FDCAN1_FDCAN_NDAT1_ND13		(1 << 13)
/** FDCAN1_FDCAN_NDAT1_ND12 New data **/
#define FDCAN1_FDCAN_NDAT1_ND12		(1 << 12)
/** FDCAN1_FDCAN_NDAT1_ND11 New data **/
#define FDCAN1_FDCAN_NDAT1_ND11		(1 << 11)
/** FDCAN1_FDCAN_NDAT1_ND10 New data **/
#define FDCAN1_FDCAN_NDAT1_ND10		(1 << 10)
/** FDCAN1_FDCAN_NDAT1_ND9 New data **/
#define FDCAN1_FDCAN_NDAT1_ND9		(1 << 9)
/** FDCAN1_FDCAN_NDAT1_ND8 New data **/
#define FDCAN1_FDCAN_NDAT1_ND8		(1 << 8)
/** FDCAN1_FDCAN_NDAT1_ND7 New data **/
#define FDCAN1_FDCAN_NDAT1_ND7		(1 << 7)
/** FDCAN1_FDCAN_NDAT1_ND6 New data **/
#define FDCAN1_FDCAN_NDAT1_ND6		(1 << 6)
/** FDCAN1_FDCAN_NDAT1_ND5 New data **/
#define FDCAN1_FDCAN_NDAT1_ND5		(1 << 5)
/** FDCAN1_FDCAN_NDAT1_ND4 New data **/
#define FDCAN1_FDCAN_NDAT1_ND4		(1 << 4)
/** FDCAN1_FDCAN_NDAT1_ND3 New data **/
#define FDCAN1_FDCAN_NDAT1_ND3		(1 << 3)
/** FDCAN1_FDCAN_NDAT1_ND2 New data **/
#define FDCAN1_FDCAN_NDAT1_ND2		(1 << 2)
/** FDCAN1_FDCAN_NDAT1_ND1 New data **/
#define FDCAN1_FDCAN_NDAT1_ND1		(1 << 1)
/** FDCAN1_FDCAN_NDAT1_ND0 New data **/
#define FDCAN1_FDCAN_NDAT1_ND0		(1 << 0)

/**@}*/

/** @defgroup fdcan1_fdcan_ndat2 FDCANNDAT2 FDCAN New Data 2 Register
@{*/

/** FDCAN1_FDCAN_NDAT2_ND63 New data **/
#define FDCAN1_FDCAN_NDAT2_ND63		(1 << 31)
/** FDCAN1_FDCAN_NDAT2_ND62 New data **/
#define FDCAN1_FDCAN_NDAT2_ND62		(1 << 30)
/** FDCAN1_FDCAN_NDAT2_ND61 New data **/
#define FDCAN1_FDCAN_NDAT2_ND61		(1 << 29)
/** FDCAN1_FDCAN_NDAT2_ND60 New data **/
#define FDCAN1_FDCAN_NDAT2_ND60		(1 << 28)
/** FDCAN1_FDCAN_NDAT2_ND59 New data **/
#define FDCAN1_FDCAN_NDAT2_ND59		(1 << 27)
/** FDCAN1_FDCAN_NDAT2_ND58 New data **/
#define FDCAN1_FDCAN_NDAT2_ND58		(1 << 26)
/** FDCAN1_FDCAN_NDAT2_ND57 New data **/
#define FDCAN1_FDCAN_NDAT2_ND57		(1 << 25)
/** FDCAN1_FDCAN_NDAT2_ND56 New data **/
#define FDCAN1_FDCAN_NDAT2_ND56		(1 << 24)
/** FDCAN1_FDCAN_NDAT2_ND55 New data **/
#define FDCAN1_FDCAN_NDAT2_ND55		(1 << 23)
/** FDCAN1_FDCAN_NDAT2_ND54 New data **/
#define FDCAN1_FDCAN_NDAT2_ND54		(1 << 22)
/** FDCAN1_FDCAN_NDAT2_ND53 New data **/
#define FDCAN1_FDCAN_NDAT2_ND53		(1 << 21)
/** FDCAN1_FDCAN_NDAT2_ND52 New data **/
#define FDCAN1_FDCAN_NDAT2_ND52		(1 << 20)
/** FDCAN1_FDCAN_NDAT2_ND51 New data **/
#define FDCAN1_FDCAN_NDAT2_ND51		(1 << 19)
/** FDCAN1_FDCAN_NDAT2_ND50 New data **/
#define FDCAN1_FDCAN_NDAT2_ND50		(1 << 18)
/** FDCAN1_FDCAN_NDAT2_ND49 New data **/
#define FDCAN1_FDCAN_NDAT2_ND49		(1 << 17)
/** FDCAN1_FDCAN_NDAT2_ND48 New data **/
#define FDCAN1_FDCAN_NDAT2_ND48		(1 << 16)
/** FDCAN1_FDCAN_NDAT2_ND47 New data **/
#define FDCAN1_FDCAN_NDAT2_ND47		(1 << 15)
/** FDCAN1_FDCAN_NDAT2_ND46 New data **/
#define FDCAN1_FDCAN_NDAT2_ND46		(1 << 14)
/** FDCAN1_FDCAN_NDAT2_ND45 New data **/
#define FDCAN1_FDCAN_NDAT2_ND45		(1 << 13)
/** FDCAN1_FDCAN_NDAT2_ND44 New data **/
#define FDCAN1_FDCAN_NDAT2_ND44		(1 << 12)
/** FDCAN1_FDCAN_NDAT2_ND43 New data **/
#define FDCAN1_FDCAN_NDAT2_ND43		(1 << 11)
/** FDCAN1_FDCAN_NDAT2_ND42 New data **/
#define FDCAN1_FDCAN_NDAT2_ND42		(1 << 10)
/** FDCAN1_FDCAN_NDAT2_ND41 New data **/
#define FDCAN1_FDCAN_NDAT2_ND41		(1 << 9)
/** FDCAN1_FDCAN_NDAT2_ND40 New data **/
#define FDCAN1_FDCAN_NDAT2_ND40		(1 << 8)
/** FDCAN1_FDCAN_NDAT2_ND39 New data **/
#define FDCAN1_FDCAN_NDAT2_ND39		(1 << 7)
/** FDCAN1_FDCAN_NDAT2_ND38 New data **/
#define FDCAN1_FDCAN_NDAT2_ND38		(1 << 6)
/** FDCAN1_FDCAN_NDAT2_ND37 New data **/
#define FDCAN1_FDCAN_NDAT2_ND37		(1 << 5)
/** FDCAN1_FDCAN_NDAT2_ND36 New data **/
#define FDCAN1_FDCAN_NDAT2_ND36		(1 << 4)
/** FDCAN1_FDCAN_NDAT2_ND35 New data **/
#define FDCAN1_FDCAN_NDAT2_ND35		(1 << 3)
/** FDCAN1_FDCAN_NDAT2_ND34 New data **/
#define FDCAN1_FDCAN_NDAT2_ND34		(1 << 2)
/** FDCAN1_FDCAN_NDAT2_ND33 New data **/
#define FDCAN1_FDCAN_NDAT2_ND33		(1 << 1)
/** FDCAN1_FDCAN_NDAT2_ND32 New data **/
#define FDCAN1_FDCAN_NDAT2_ND32		(1 << 0)

/**@}*/

/** @defgroup fdcan1_fdcan_rxf0c FDCANRXF0C FDCAN Rx FIFO 0 Configuration Register
@{*/


#define FDCAN1_FDCAN_RXF0C_F0WM_SHIFT		24
#define FDCAN1_FDCAN_RXF0C_F0WM_MASK		0xff
/** @defgroup fdcan1_fdcan_rxf0c_f0wm F0WM FIFO 0 Watermark
@{*/
/**@}*/


#define FDCAN1_FDCAN_RXF0C_F0S_SHIFT		16
#define FDCAN1_FDCAN_RXF0C_F0S_MASK		0xff
/** @defgroup fdcan1_fdcan_rxf0c_f0s F0S Rx FIFO 0 Size
@{*/
/**@}*/


#define FDCAN1_FDCAN_RXF0C_F0SA_SHIFT		2
#define FDCAN1_FDCAN_RXF0C_F0SA_MASK		0x3fff
/** @defgroup fdcan1_fdcan_rxf0c_f0sa F0SA Rx FIFO 0 Start Address
@{*/
/**@}*/


/**@}*/

/** @defgroup fdcan1_fdcan_rxf0s FDCANRXF0S FDCAN Rx FIFO 0 Status Register
@{*/

/** FDCAN1_FDCAN_RXF0S_RF0L Rx FIFO 0 Message Lost **/
#define FDCAN1_FDCAN_RXF0S_RF0L		(1 << 25)
/** FDCAN1_FDCAN_RXF0S_F0F Rx FIFO 0 Full **/
#define FDCAN1_FDCAN_RXF0S_F0F		(1 << 24)

#define FDCAN1_FDCAN_RXF0S_F0P_SHIFT		16
#define FDCAN1_FDCAN_RXF0S_F0P_MASK		0x3f
/** @defgroup fdcan1_fdcan_rxf0s_f0p F0P Rx FIFO 0 Put Index
@{*/
/**@}*/


#define FDCAN1_FDCAN_RXF0S_F0G_SHIFT		8
#define FDCAN1_FDCAN_RXF0S_F0G_MASK		0x3f
/** @defgroup fdcan1_fdcan_rxf0s_f0g F0G Rx FIFO 0 Get Index
@{*/
/**@}*/


#define FDCAN1_FDCAN_RXF0S_F0FL_SHIFT		0
#define FDCAN1_FDCAN_RXF0S_F0FL_MASK		0x7f
/** @defgroup fdcan1_fdcan_rxf0s_f0fl F0FL Rx FIFO 0 Fill Level
@{*/
/**@}*/


/**@}*/

/** @defgroup fdcan1_fdcan_rxf0a FDCANRXF0A CAN Rx FIFO 0 Acknowledge Register
@{*/


#define FDCAN1_FDCAN_RXF0A_FA01_SHIFT		0
#define FDCAN1_FDCAN_RXF0A_FA01_MASK		0x3f
/** @defgroup fdcan1_fdcan_rxf0a_fa01 FA01 Rx FIFO 0 Acknowledge Index
@{*/
/**@}*/


/**@}*/

/** @defgroup fdcan1_fdcan_rxbc FDCANRXBC FDCAN Rx Buffer Configuration Register
@{*/


#define FDCAN1_FDCAN_RXBC_RBSA_SHIFT		2
#define FDCAN1_FDCAN_RXBC_RBSA_MASK		0x3fff
/** @defgroup fdcan1_fdcan_rxbc_rbsa RBSA Rx Buffer Start Address
@{*/
/**@}*/


/**@}*/

/** @defgroup fdcan1_fdcan_rxf1c FDCANRXF1C FDCAN Rx FIFO 1 Configuration Register
@{*/


#define FDCAN1_FDCAN_RXF1C_F1WM_SHIFT		24
#define FDCAN1_FDCAN_RXF1C_F1WM_MASK		0x7f
/** @defgroup fdcan1_fdcan_rxf1c_f1wm F1WM Rx FIFO 1 Watermark
@{*/
/**@}*/


#define FDCAN1_FDCAN_RXF1C_F1S_SHIFT		16
#define FDCAN1_FDCAN_RXF1C_F1S_MASK		0x7f
/** @defgroup fdcan1_fdcan_rxf1c_f1s F1S Rx FIFO 1 Size
@{*/
/**@}*/


#define FDCAN1_FDCAN_RXF1C_F1SA_SHIFT		2
#define FDCAN1_FDCAN_RXF1C_F1SA_MASK		0x3fff
/** @defgroup fdcan1_fdcan_rxf1c_f1sa F1SA Rx FIFO 1 Start Address
@{*/
/**@}*/


/**@}*/

/** @defgroup fdcan1_fdcan_rxf1s FDCANRXF1S FDCAN Rx FIFO 1 Status Register
@{*/


#define FDCAN1_FDCAN_RXF1S_DMS_SHIFT		30
#define FDCAN1_FDCAN_RXF1S_DMS_MASK		0x03
/** @defgroup fdcan1_fdcan_rxf1s_dms DMS Debug Message Status
@{*/
/**@}*/

